public/boloñesa.html
<!DOCTYPE html>
<html lang="coba">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for .">
<title>boloñesa</title>
<meta property="og:title" content="boloñesa">
<meta property="og:type" content="article" />
<meta property="og:url" content="./boloñesa.html">
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Coba</title>
<meta name="author" content="Coba">
<meta name="referrer" content="no-referrer">
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body>
<div id="preamble" class="status"><header><h1><a href="./index.html">Coba</a></h1>
  <nav>
    <ul>
      <li> <a href="./posts.html">posts</a> </li>
      <li> <a href="./tags.html">tags</a> </li>
      <li> <a href="./now.html">now</a> </li>
    </ul>
</nav></header>
</div>
<div id="content">
<div class="title-with-tags">
<h1 class="post-title"><a href="./boloñesa.html">boloñesa</a></h1>
<div class="taglist">

<a href="./tags.html#food">food</a></div>
</div>
<div class="post-date">
~ 2026-03-08</div><p>
Some friends asked for a recipe of my ragù alla bolognese, which is quite default and I don't do anything too creative about it. The things that make a difference: buying nice quality minced meat, buying tomatoes that taste like something and making sure to fry before boiling the meat.
</p>

<p>
Ingredients:
</p>
<ul class="org-ul">
<li>1.5kg minced meat, not too fatty, half pork half beef.</li>
<li>2kg of tomatoes. If you don't have access to fresh tomatoes grown until ripe on the plant, the best bet are canned tomatoes from a nice brand, like anything with a San Marzano DOP. And tomato paste.</li>
<li>Mirepoix: a sensible amount of carrots, celery and onion. And garlic.</li>
<li>Red wine that you'd drink.</li>
<li>Herbs.</li>
</ul>

<p>
On a +7L pot:
</p>
<ul class="org-ul">
<li>Add the <b>mince</b> in fistfuls into highish heat, letting each portion cook, release and evaporate its water content, and fry and develop some color. If all the mince is added together, the pot cannot transmit enough heat to evaporate water as it's released; and it the meat boils into grey chunks, instead of frying into dark brown crumble.
<ul class="org-ul">
<li>If there's time pressure, you can use a second pan to brown the meat faster in parallel.</li>
</ul></li>
<li>Add the <b>mirepoix</b>, the <b>garlic</b> and the <b>tomato paste</b>, and let it cook until translucentish and the tomato paste starts sticking to the bottom of the pot.</li>
<li>Add ~0.5L of <b>red wine</b>, stir to scrub clean the bottom of the pot, and let it cook for a bit.</li>
<li>Add the <b>tomatoes</b>. If they are fresh take the woody bits out (and peel them if you don't want to notice the skin cannoli).</li>
<li>Add <b>herbs</b>, parsley rosemary thyme oregano basil, black pepper chilly.</li>
<li>Once it boils reduce to low heat and let it cook for a few hours until it's reduced to the consistency you want. Stir semi frequently, don't let the bottom burn.</li>
</ul>

<p>
Bolognese in the fridge, bolognese in the freezer. Bolognese in lasagna with almond-milk bechamel.
</p>
</div>
<div id="postamble" class="status"><footer>
  <ul>
    <li><a href="https://signal.me/#eu/t3thXZW1FI9T0n2CYX61MYLtD_QcSN7K2o6pHrNCbQm8ASIIl35IOI4lexae_c8f">💬 coba.01</a></li>
    <li>💌 coba@cobac.eu, <a href="./public-coba.txt">PGP key</a></li>
    <li><a href="https://www.github.com/cobac">✍🏻 github.com/cobac</a></li>
    <li><a href="https://linkedin.cobac.eu">💰 linkedin.cobac.eu</a></li>
    <!-- <li><a href="https://bsky.app/profile/cobalente.bsky.social">🦋 cobalente.bsky.social</a></li> -->
    <!-- <li><a href="https://hachyderm.io/@coba">🐘 hachyderm.io/@coba</a></li> -->
  </ul>
</footer>
</div>
</body>
</html>
